In [18]:
import pandas as pd

In [22]:
df = pd.read_csv('C:/Users/kdundar/Downloads/titanic.csv')

In [25]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [37]:
df.columns = df.columns.str.lower()

In [38]:
df["sex"]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [39]:
df["sex"] = df["sex"].map({"female":1, "male" : 0})

In [54]:
df.head()
df.columns

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [55]:
df.groupby(["survived","parch"]).agg({"age":"mean","fare":"mean"})

                      age       fare
survived parch
0        0      32.082090  16.548124
         1      26.571429  37.111642
         2      17.000000  55.625000
         3      32.000000  34.375000
         4      44.500000  84.968750
         5      39.500000  32.840625
         6      43.000000  46.900000
1        0      32.352151  42.849430
         1      22.695410  54.660126
         2      17.378205  73.050207
         3      34.000000  20.336100
         5      38.000000  31.387500

In [61]:
import numpy as np

In [63]:
dff = np.arange(1,11)
dff

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [65]:
np.square(dff)

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100])

In [66]:
np.sum(dff)

55

In [77]:
dff = dff.reshape(2,5)

In [80]:
dff[:,0]

array([1, 6])

In [81]:
fd = np.arange(1,16)
fd

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [85]:
fd = fd.reshape(3,5)
fd

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [89]:
fd[0:2,0:2]

array([[1, 2],
       [6, 7]])